## Insert

In [2]:
import pandas as pd
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,4,5]})
print(var)

   A  B
0  1  9
1  2  8
2  3  7
3  4  4
4  5  5

In [3]:
var.insert(1,"python",var["A"])
var

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  4
4  5       5  5

In [6]:
var["python_12"]=var["A"][::3]
var

   A  python  python_12
0  1       1        1.0
1  2       2        NaN
2  3       3        NaN
3  4       4        4.0
4  5       5        NaN

In [5]:
var1=var.pop("B")
var1

0    9
1    8
2    7
3    4
4    5
Name: B, dtype: int64

In [7]:
var

   A  python  python_12
0  1       1        1.0
1  2       2        NaN
2  3       3        NaN
3  4       4        4.0
4  5       5        NaN

In [8]:
del var["A"]
var

   python  python_12
0       1        1.0
1       2        NaN
2       3        NaN
3       4        4.0
4       5        NaN